src/Documents/Scan_УстановкаЦенКомпонентов/Scan_УстановкаЦенКомпонентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_УстановкаЦенКомпонентов</name>
  <registerRecords>InformationRegister.Scan_ЦеныКомпонентовСпецификаций</registerRecords>
  <registerRecords>InformationRegister.Scan_КвотыSOrderFFUПлан</registerRecords>
  <attributes>
    <name>НомерЗапросаВPRS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапросаPRS</name>
    <type>
      <types>EnumRef.Scan_ТипыЗапросовPRS</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросСогласованЗаводами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИзделийВЗапросе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияSOrder</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодДействияЗапросаС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериоддействияЗапросаПо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗапроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвторЗапроса</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ISOКодСтраны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЗавод</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Компонент</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>СложныйSOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Калькуляция</name>
    <type>
      <types>DocumentRef.Scan_Калькуляция</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Scan_Изделия</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Scan_ВерсииБазовыхСпецификаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗамен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоПрайсЛисту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРучныхЗамен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСпецификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаРасчет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОпцииSOrder</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СогласованиеЗаводами</name>
    <attributes>
      <name>Завод</name>
      <type>
        <types>CatalogRef.Scan_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеСложногоSOrder</name>
    <attributes>
      <name>КодОснащения</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеАнглийское</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоПрайсЛисту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Замена</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменаРучная</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРучнойЗамены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставСпецификации</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НезагруженныеОпции</name>
    <attributes>
      <name>Исполнение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_КвотыSOrderFFUПлан/Scan_КвотыSOrderFFUПлан.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КвотыSOrderFFUПлан</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КвотаSOrderFFU</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ЦеныКомпонентовСпецификаций/Scan_ЦеныКомпонентовСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЦеныКомпонентовСпецификаций</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ТипЗначенияЦены</name>
    <type>
      <types>EnumRef.Scan_ТипыЗначенийЦены</types>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДоДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетДоPartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДействуетСPartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.Scan_ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Опции</name>
    <type>
      <types>CatalogRef.Scan_ЦеновыеПакеты</types>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ИнформацияПоPartPeriod/Scan_ИнформацияПоPartPeriod.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИнформацияПоPartPeriod</name>
  <resources>
    <name>КрайнийСрокРазмещенияЗаказаНаЗавод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>PartPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Scan_УстановкаЦенКомпонентов/ObjectModule.bsl
//rarus BProg_Gladkov 11.12.2019 0014560 +-

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТекущийПользователь 	= ПользователиКлиентСервер.ТекущийПользователь() ;
	Организация 			= ТекущийПользователь.Организация;
	ПодразделениеКомпании 	= ТекущийПользователь.ПодразделениеОрганизации;
	Автор 					= ТекущийПользователь;
	Менеджер 				= ТекущийПользователь;
	Дата 					= ТекущаяДата();
	ВалютаДокумента 		= Справочники.Валюты.НайтиПоКоду("643");
	//rarus vikhle 22.04.2020 mt 15695 +++
	Scan_ВспомогательныеФункцииСервер.ЗаполнитьКомпаниюИКонтрагента(ТекущийПользователь,Компания,Контрагент);	
	//rarus vikhle 22.04.2020 mt 15695 ---
		
	//rarus BProg_Gladkov 13.01.2020 0014560 +++
	АвторЗапроса 			= Автор;
	//rarus BProg_Gladkov 13.01.2020 0014560 ---
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//rarus vikhle 17.11.2020 mt 16638 +++ условие по хоз операции
	Если ХозОперация = Справочники.Scan_ХозяйственныеОперации.УстановкаЦенКомпонентов Тогда
		СформироватьДвижения_ЦеныКомпонентовСпецификаций(Отказ);
		СформироватьДвижения_КвотыSOrderFFUПлан(Отказ);
	Иначе
		Движения.Scan_КвотыSOrderFFUПлан.Записывать 			= Истина;
		Движения.Scan_ЦеныКомпонентовСпецификаций.Записывать	= Истина;
	КонецЕсли;	
	//rarus vikhle 17.11.2020 mt 16638 ---
	
КонецПроцедуры

Процедура СформироватьДвижения_ЦеныКомпонентовСпецификаций(Отказ)
	Движения.Scan_ЦеныКомпонентовСпецификаций.Записывать 	= Истина;
	Если НЕ ЗапросСогласованЗаводами тогда//rarus BProg_Dekin 31.03.2020 mantis 0014560 +- Если НЕ ЗапросСогласованЗаводом тогда
		Возврат;
	КонецЕсли;
	
	ВалютаРеглУчета = Константы.Scan_ВалютаРегламентированногоУчета.Получить();
	Если ВалютаРеглУчета.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнена валюта регламентированого учета'; 
			 				  |en = 'The currency of the regulated accounting is not filled'"); 
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ЦенаРегл = РаботаСКурсамиВалют.ПересчитатьВВалюту(ЦенаЗапроса, ВалютаДокумента, ВалютаРеглУчета, Дата);
	
	ДвижениеЦеныКомпонентовСпецификаций = Движения.Scan_ЦеныКомпонентовСпецификаций.Добавить();
	ДвижениеЦеныКомпонентовСпецификаций.Период 		= Дата;
	ДвижениеЦеныКомпонентовСпецификаций.Опции 		= Компонент;
	ДвижениеЦеныКомпонентовСпецификаций.Цена 		= ЦенаЗапроса;
	ДвижениеЦеныКомпонентовСпецификаций.ЦенаРегл 	= ЦенаРегл;
КонецПроцедуры

Процедура СформироватьДвижения_КвотыSOrderFFUПлан(Отказ)
	Движения.Scan_КвотыSOrderFFUПлан.Записывать = Истина;
	Если НЕ ЗапросСогласованЗаводами Тогда //rarus BProg_Dekin 31.03.2020 mantis 0014560 +- Если НЕ ЗапросСогласованЗаводом тогда
		Возврат;
	КонецЕсли;

	ДвижениеКвотыSOrderFFUПлан = Движения.Scan_КвотыSOrderFFUПлан.Добавить();
	ДвижениеКвотыSOrderFFUПлан.Период				= Дата;
	ДвижениеКвотыSOrderFFUПлан.Опция 				= Компонент;
	ДвижениеКвотыSOrderFFUПлан.КвотаSOrderFFU 		= КоличествоИзделийВЗапросе;
	ДвижениеКвотыSOrderFFUПлан.ДатаС 				= ПериодДействияЗапросаС;
	ДвижениеКвотыSOrderFFUПлан.ДатаПо 				= ПериоддействияЗапросаПо;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//rarus BProg_Gladkov 13.01.2020 0014560 +++
	Если ЗначениеЗаполнено(ПериодДействияЗапросаС) Тогда 
		Отказ = РегистрыСведений.Scan_ИнформацияПоPartPeriod.ПроверитьПартПериод(ПериодДействияЗапросаС);
		Если Отказ тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПериодДействияЗапросаПо) Тогда 
		Отказ  = РегистрыСведений.Scan_ИнформацияПоPartPeriod.ПроверитьПартПериод(ПериодДействияЗапросаПо);
		Если Отказ тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	КрайнийСрокРазмещенияЗаказаНаЗавод = Документы.Scan_УстановкаЦенКомпонентов.ПолучитьКрайнийСрокРазмещенияЗаказНаЗаводПоПартПериоду(ПериодДействияЗапросаПо);
	Если КрайнийСрокРазмещенияЗаказаНаЗавод = Неопределено тогда
		ТекстСообщения = НСтр("ru = 'Внимание! По указанному Part Period в поле «По» нет записей в регистре «Информация по Part Period». Добавьте информацию в регистр.'; 
							  |en = 'Attention! For the specified Part Period, in the ""To"" field there are no entries in the register ""Information by Part Period"" . Add information to the register.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
//rarus BProg_Gladkov 13.01.2020 0014560 ---
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//rarus BProg_Dekin 31.03.2020 mantis 0014560 ++
	СтруктураПоиска = Новый Структура("Согласовано", Истина);
	СогласованныеСтроки 	= СогласованиеЗаводами.НайтиСтроки(СтруктураПоиска);
	ВсеСтрокиСогласованны 	= СогласованныеСтроки.Количество() = СогласованиеЗаводами.Количество();
	
	ЗапросСогласованЗаводами = ЗначениеЗаполнено(СогласованиеЗаводами) И ВсеСтрокиСогласованны;
	//rarus BProg_Dekin 31.03.2020 mantis 0014560 --
КонецПроцедуры
